var React = require('react');

var YunAgreement = React.createClass({
    displayName: 'YunAgreement',
    render() {
        return (
            <div className=" animated fadeIn">
            	<p className="agree-title yy-c3e">《云账户用户服务协议》</p>

		        <p>为了使用云账户服务，您应当事先阅读并同时遵守北京云予网络科技有限公司（以下简称“云账户”）与您签署服务协议》（以下简称本协议）及您与有关金融机构（包括但不限于基金公司、保险公司、银行、证券公等）签署的相关服务协议（具体名称以该金机构协议规定的为准），依据本协议为用户（以下或称“您”）提供理财服务。</p>

		        <p>在此特别提醒您认真阅读和充分理本协议各条款，特别是其中所涉及的免除或制云账户责任、限制用户权利、争议解和法律适用等条款。请您审慎阅读并选择是接受本协议（未成年人应在监护人陪同下阅读），除非您接受本协议所有条款，否则您无权使用云账户的理财服务。</p>
		        <p>您―经点击确认或以其他方式选择接受本协议，即视为对协议的理解和接受，您同意本协议对云账户和您具有法律约束力，如果您不同意本的任何内容或无法准确理解相关条款，请不要进行后续操作。</p>

		        <p className="agree-lite yy-c3e">一、定义</p>
		        <p>除本协议另有规定外，下列用语具有如下含义：</p>
		        <p>1.云账户服务：指云账户基于与有关金融机构的系统对接，为投资者提供的一项服务，包括通过云账户系统与金融机构系统的整合协助您在金融机构完成相关金融产品的开户、在线交易、信息查询等服务。</p>
		        <p>2.身份认证要素：指云账户在交易中用识别投资者身份的信息要素包括但不限于投资者的云账户注册名及其密码、数字证书、动态口令、证件类型、证件号码、签约时留存的手机号码等及法律法规或云账户要求的其他要素。</p>

		        <p className="agree-lite yy-c3e">二、适用范围</p>
		        <p>3.云账户服务仅面向中华人民共和国境内具有完全民事权利能力和民事行为能力、能够独立承担民事责任的自然人提供。您必须按照云账户公司的要求提供合法、真实、准确及完整的身份信息并及时更新。</p>
		        <p>4.如云账户发现或有合理理由怀疑您提供的身份信息不合法、不真实、不准确、不完整，云账户有权立即中止（或终止）向您提供服务，并拒绝您现在或未来使用云账户服务全部或部分功能，由此给您造成的任何损失由您自行承担；如您未及时更新您的身份信息，而导致云账户无法及时为您本协议下的服务或云账户服务的有关流程及操作发生任何错误，由此给您造成的任何损失均由您自行承担。</p>

		        <p className="agree-lite yy-c3e">三、特别提示</p>
		        <p>1.您知悉并同意，云账户有权采取各种必要手段对您进行身份验证，同时，云账户有权据此决定是否同意为您提供理财通服务、提供服务的范围、种类、业务操作权限及相关额度限制。为保障您的资金安全、财付通公司有权根据投资者类别、身份认证措施、交易风险等因素设定不同的风控措施。</p>
		        <p>2.您知悉并同意，身份认证要素是云账户识别您身份的唯一依据，您应妥善保管您的身份认证要素，不得将您的身份认证要素泄露给任何第三方或交于任何第三方使用。云账户将对经过您的上述身份要素所发送的一切指令默认为您本人的行为，您应自行对上述指令产生的后果负责。同时，您应对非云账户原因造成的账户、密码等信息被冒用、盗用或非法使用所引起的一切风险和损失应自行承担责任。</p>
		        <p>3.为了向您提供云账户服务，您同意并授权云账户有权将所持有的您的个人信息包括但不限于姓名、身份证件号、手机号、邮箱、联系地址、云账户账号、银行卡号等提供给相关金融机构；基于云账户服务的相关需要，您同意并授权相关金融机构有权将其所持有的您的个人信息包括但不限于您在该机构的账户、交易信息、资产状况等提供给云账户。</p>
		        <p>4.您知悉并同意，您开通云账户服务的同时即开通云账户账户并同意签订《云账户服务协议》，如相关金融产品基于业务的正常开展需同时开通其他账户或功能，您也同意并接受相关服务协议或条款。</p>
		        <p>5.您知悉并同意，您网上提交的资金划转委托以银行系统与本公司系统记录为准；您提交的金融产品交易委托以金融机构的系统记录为准。您登录云账户可查询到您持有金融产品的净额、收益、交易明细等，但该数据仅供参考使用，所有数据应以金融机构系统数据为准。</p>
		        <p>6.云账户仅作为金融服务提供商，您一旦通过云账户服务成功买入相关金融机构的产品即视为您与金融机构缔结相应协议或产品合同。云账户并非为金融产品销售合同的缔约方，不对金融产品销售合同中做出任何书面或口头陈述或承诺，同时也不对金融产品的相关真实性合法性提供任何明示或暗示的保证或担保，也不对金融机构销售相关金融产品对向您承担任何连带责任。</p>

		        <p className="agree-lite yy-c3e">四、不可抗力及其他免责事由</p>
		        <p>1.在云账户提供服务过程中，可能会遇到不可抗力等风险因素，使理财通服务发生中断。不可抗力是指不能预见、不能克服、不能避免且对一方或双方造成重大影响的客观事件，包括但不限于洪水、地震、瘟疫和风暴等自然灾害以及战争、动乱、政府行为等社会事件。出现上述情况时，云账户将努力在第一时间与相关单位配合及时进行修复，但由此给您造成的损失，云账户在法律允许的范围内免责。</p>
		        <p>2.在法律允许的范围内，财付通公司对以下情形导致的服务中断或受阻不承担责任：</p>
		        <p>（1）受到计算机病毒木马或其他恶意程序黑客攻击的破坏；</p>
		        <p>（2）用户或财付通公司的电脑软件、系统、硬件和通信线路出现故障；</p>
		        <p>（3）用户操作不当；</p>
		        <p>（4) 用户通过非云账户授权的方式使用云账户服务；</p>
		        <p>（5）银行系统或银行网络出现故障；</p>
		        <p>（6）其他财付通公司无法控制或合理预见的情形。</p>
		        <p>3.您在使用云账户服务的过程中，云账户不对下列风险担责：</p>
		        <p>（1）来自他人匿名或冒名的含有威胁、诽谤令人反感或非法内容的信息；</p>
		        <p>（2）遭受他人误导、欺骗或其他导致任何心理、生理上的伤害以及经济上的损失。</p>
		        <p>4.您在使用云账户服务过程中，云账户在法律规定的范围内可处理违法违规内容，但其不构成云账户的义务或承诺。</p>

		        <p className="agree-lite yy-c3e">五、暂停、中断或终止服务</p>
		        <p>5.云账户有权基于业务调整或风险管控的需要暂停、中断或终止向您提供云账户服务。</p>
		        <p>6.云账户在发现您有可疑交易时，有权不经通知暂停、中断或终止向您提供云账户服务。</p>
		        <p>7.云账户发现您违反本协议约定的，有权暂停中断或终止向您提供云账户服务。 </p>

		        <p className="agree-lite yy-c3e">六、法律适用及争端解决</p>
		        <p>1.本协议签订地为中华人民共和国北京市朝阳区。</p>
		        <p>2.本协议的成立、生效、履行、解释及纠纷解，决适用中华人民共和国大陆地区法律（不包括冲突法）。</p>
		        <p>3.您和云账户因本协议产生任何纠纷或争议的，首先应友好协商解决，协商不成的您同意将纠纷或争议提交至本协议签订地有管辖权的人民法院解决。</p>

		        <p className="agree-lite yy-c3e">七、其他条款</p>
		        <p>1.本协议所有条款的标题仅为阅读方便，本身，并无实际涵义，不能作为本协议涵义解释的依据。</p>
		        <p>2.云账户有权在必要时修改本协议条款，您可以在相关服务页面查阅最新版本的协议条款。本协议条款变更后，如果您继续使用云账户提供的软件或服务，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用云账户提供的软件或服务。</p>
		        <p>3.您使用理财通服务时，财付通公司可使用电子方式向您发出通知，上述电子方式包括但不限于微信、电子邮箱、手机号码、云账户客服QQ号码、电话、云账户网站等方式。</p>
		        <p>4.本协议条款无论因何种原因部分无效，其余，条款仍有效且双方具有约束力。</p>
		    </div>
		);
    }
});

module.exports = YunAgreement;
